# Написать программу, создающую список из введенной пользователем строки цифр (без пробелов).
# Вывести все элементы строки, которые имеют нечетные индексы.
my_list = list(input("Enter a number: "))
print(my_list[1::2])