# Напишите программу, в которой расстояние, указанное в милях, переводится в километры.
# Учесть, что одна миля примерно равна 1,6 километра. Расстояние в милях вводится пользователем
miles = float(input('Enter miles: '))
milesToKilometre = miles * 1.6
print(milesToKilometre)