# Напишите программу, которая запрашивает число и организовывает следующий вывод:
# Введенное число Х, число меньше на 5: Х-5, число большее на 12.5: Х+12.5
X = int(input("Введите число: "))
print(f"Введенное число: {X}, число меньшее на 5: {X - 5}, число большее на 12.5: {X + 12.5}")